DJMaxergy/ESP32_ArtNetNode/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include "espDMX_RDM.h"
#include "espArtNetRDM.h"
#include "wsFX.h"
#include <NeoPixelBus.h>
#include "config.h"
#include <ESPUI.h>
#include "DNSServer.h"
#include <Updater.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

extern "C" {
  #include "user_interface.h"
  extern struct rst_info resetInfo;
}

// #define DEBUG
// #define SOLE_OUTPUT
// #define OLED

#define TIMEOUT_AP                  30000       // Timeout [ms] before closing Access Point if standalone mode is false
#define TIMEOUT_CLEAR_COUNTERS      6000        // Timeout [ms] before clearing wdt and reset counters
#define TIMEOUT_DMX                 3000        // Timeout [ms] before pausing dmx output when no artnet data is received anymore
#define INTERVAL_STATUS_LED         1000        // Interval for updating Status LEDs
#define INTERVAL_STATUS_LED_UPDATE  500         // Interval for updating Status LEDs in case of OTA Update
#define LIM_PIXELS_PER_ARTNET_PORT  170         // Maximum allowed number of pixels per ArtNet port
#define STATUS_LED_COLOR_SAT        11          // Status LEDs brightness
#define DNS_PORT                    53          // Port used by DNS server

#ifdef OLED
  #define DISP_LOGO_WIDTH    128
  #define DISP_LOGO_HEIGHT   32
  const unsigned char dispLogo [] PROGMEM = {
    // 'Art-Net-DJ-logo-scaled, 128x32px
    0x03, 0x01, 0xfc, 0x1f, 0xff, 0xc0, 0x00, 0x00, 0x00, 0x01, 0x04, 0x80, 0x00, 0x00, 0x00, 0x00, 
    0x03, 0x81, 0x9f, 0x1f, 0xff, 0xc0, 0x00, 0x00, 0x11, 0x83, 0x07, 0x87, 0x00, 0x00, 0x00, 0x00, 
    0x06, 0x81, 0x81, 0x80, 0x60, 0x00, 0x00, 0x00, 0x19, 0x83, 0x07, 0x04, 0x0e, 0x00, 0x00, 0x00, 
    0x04, 0xc1, 0x81, 0x80, 0x60, 0x00, 0x00, 0x00, 0x19, 0x83, 0x83, 0x04, 0x0f, 0x00, 0x00, 0x00, 
    0x0c, 0x41, 0x80, 0x80, 0x60, 0x00, 0x00, 0x80, 0x1d, 0x87, 0x83, 0x07, 0x0f, 0x0f, 0x00, 0x00, 
    0x08, 0x61, 0x81, 0x80, 0x60, 0x00, 0x00, 0xc0, 0x1f, 0x87, 0x87, 0x04, 0x0e, 0x09, 0x00, 0x00, 
    0x18, 0x61, 0x83, 0x80, 0x60, 0x00, 0x00, 0xc0, 0x1e, 0x84, 0xc5, 0x84, 0x0e, 0x18, 0x08, 0x00, 
    0x18, 0x31, 0x9f, 0x00, 0x60, 0x00, 0x60, 0x40, 0x1e, 0x84, 0x44, 0x87, 0x0a, 0x17, 0x0d, 0x00, 
    0x3f, 0xf1, 0x8c, 0x00, 0x60, 0x00, 0xf0, 0x40, 0x12, 0x00, 0x00, 0x00, 0x0b, 0x1b, 0x0f, 0x00, 
    0x30, 0x11, 0x84, 0x00, 0x60, 0x00, 0x98, 0x40, 0x00, 0x00, 0x00, 0x00, 0x00, 0x1b, 0x0e, 0x00, 
    0x20, 0x19, 0x86, 0x00, 0x60, 0x00, 0x98, 0xc0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0e, 0x0c, 0x00, 
    0x60, 0x09, 0x83, 0x00, 0x60, 0x00, 0xc8, 0xc0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0c, 0x00, 
    0x40, 0x0d, 0x81, 0x80, 0x60, 0x00, 0x58, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x00, 0x08, 0x00, 
    0x00, 0x00, 0x00, 0x00, 0x60, 0x00, 0x70, 0x00, 0x08, 0x04, 0x00, 0x04, 0x00, 0x00, 0x08, 0x00, 
    0xe0, 0x01, 0x8f, 0xfe, 0x60, 0x00, 0x60, 0x00, 0x04, 0x04, 0x00, 0x04, 0x00, 0x00, 0x00, 0x00, 
    0xf0, 0x03, 0x8f, 0xfe, 0x60, 0x00, 0x00, 0x00, 0x04, 0x04, 0x10, 0x04, 0x00, 0x00, 0x00, 0x00, 
    0xf8, 0x01, 0x8c, 0x00, 0x60, 0x00, 0x00, 0x40, 0x04, 0x24, 0x11, 0x04, 0x00, 0x10, 0x00, 0x00, 
    0xd8, 0x01, 0x8c, 0x00, 0x60, 0x00, 0x00, 0x40, 0x04, 0x20, 0x11, 0x04, 0x40, 0x10, 0x20, 0x00, 
    0xcc, 0x01, 0x8c, 0x00, 0x60, 0x00, 0x08, 0x20, 0x92, 0x20, 0x00, 0x00, 0x40, 0x30, 0x40, 0x00, 
    0xce, 0x01, 0x8c, 0x00, 0x60, 0x00, 0x08, 0x20, 0x90, 0x00, 0x00, 0x00, 0x00, 0x20, 0x40, 0x00, 
    0xc7, 0x01, 0x8c, 0x00, 0x60, 0x00, 0x04, 0x20, 0x00, 0x3f, 0xff, 0xf6, 0x00, 0x28, 0x80, 0x00, 
    0xc3, 0x01, 0x8c, 0x00, 0x60, 0x00, 0x05, 0x10, 0x0f, 0xff, 0xff, 0xff, 0xf8, 0x0a, 0x80, 0x00, 
    0xc1, 0x81, 0x8f, 0xfe, 0x60, 0x00, 0x03, 0x00, 0xff, 0xff, 0xff, 0xf7, 0xff, 0x81, 0x00, 0x00, 
    0xc0, 0xc1, 0x8f, 0xfe, 0x60, 0x00, 0x02, 0x07, 0xff, 0x80, 0x00, 0x01, 0xff, 0xf0, 0x00, 0x00, 
    0xc0, 0xe1, 0x8c, 0x00, 0x60, 0x00, 0x00, 0x3f, 0xe0, 0x00, 0x00, 0x00, 0x07, 0xfe, 0x00, 0x00, 
    0xc0, 0x61, 0x8c, 0x00, 0x60, 0x00, 0x01, 0xfe, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3f, 0xc0, 0x00, 
    0xc0, 0x31, 0x8c, 0x00, 0x60, 0x00, 0x07, 0xf0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x07, 0xf0, 0x00, 
    0xc0, 0x19, 0x8c, 0x00, 0x60, 0x1c, 0x1f, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xfc, 0x04, 
    0xc0, 0x1d, 0x8c, 0x00, 0x60, 0x1c, 0x1c, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x1e, 0x0e, 
    0xc0, 0x0f, 0x8c, 0x00, 0x60, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x06, 0x0e, 
    0xc0, 0x07, 0x8f, 0xfe, 0x60, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x04, 
    0xc0, 0x03, 0x8f, 0xfe, 0x60, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
  };
#endif

/* ---------------- Pin config ---------------- */
#define PIN_DMX_DIR_A               13  // D1 Mini: D7
#define PIN_DMX_DIR_B               16  // D1 Mini: D0
#define PIN_PORT_A                  1   // D1 Mini: TX
#define PIN_PORT_B                  2   // D1 Mini: D4

#define PIN_STATUS_LED              12  // D6, approved: 3 = RX (DMA support, but used for DMX input)
// Physical wiring order for status LEDs:
#define ADDR_STATUS_LED_S           0
#define ADDR_STATUS_LED_A           1
#define ADDR_STATUS_LED_B           2

#define PIN_RESET_CONFIG            14
/* -------------- Pin config end -------------- */

Config config, configActive;
esp8266ArtNetRDM artRDM;
DNSServer dnsServer;

uint8_t portA[5], portB[5];
uint8_t macAddr[6];
char macAddr_str[18];
uint32_t statusTimer = 0;
uint32_t artDmxReceiveTimer = 0;

char wifiStatus[100] = "";
bool accessPointStarted = false;
uint32_t nextNodeReport = 0;
char nodeError[ARTNET_NODE_REPORT_LENGTH] = "";
bool nodeErrorShowing = 1;
uint32_t nodeErrorTimeout = 0;
bool pixDone = true;
bool newDmxIn = false;
byte* dataIn;
bool doReboot = false;
bool dmxOutAPaused = false;
#ifndef SOLE_OUTPUT
  bool dmxOutBPaused = false;
#endif
bool artDmxReceiving = false;

#ifdef SOLE_OUTPUT
  NeoPixelBus<NeoGrbFeature, NeoEsp8266AsyncUart0Ws2812xMethod>* pixPortA = NULL; // uses shared interrupt -> conflicts with DMX output
  pixPatterns* pixFXA;
#else
  NeoPixelBus<NeoGrbFeature, NeoEsp8266Uart0Ws2812xMethod>* pixPortA = NULL;
  NeoPixelBus<NeoGrbFeature, NeoEsp8266Uart1Ws2812xMethod>* pixPortB = NULL;
  pixPatterns* pixFXA;
  pixPatterns* pixFXB;
#endif

