DJMaxergy/ESP32_ArtNetNode/src/main.cpp
// NeoPixelBus<NeoGrbFeature, NeoEsp8266DmaWs2812xMethod> statusStrip(3, PIN_STATUS_LED); // approved (DMA)
NeoPixelBus<NeoGrbFeature, NeoEsp8266BitBangWs2812xMethod> statusStrip(3, PIN_STATUS_LED);
RgbColor red(STATUS_LED_COLOR_SAT, 0, 0);
RgbColor green(0, STATUS_LED_COLOR_SAT, 0);
RgbColor yellow(STATUS_LED_COLOR_SAT, STATUS_LED_COLOR_SAT, 0);
RgbColor blue(0, 0, STATUS_LED_COLOR_SAT);
RgbColor cyan(0, STATUS_LED_COLOR_SAT, STATUS_LED_COLOR_SAT);
RgbColor white(STATUS_LED_COLOR_SAT);
RgbColor black(0);
RgbColor pink(STATUS_LED_COLOR_SAT, STATUS_LED_COLOR_SAT/11, STATUS_LED_COLOR_SAT/3);

#ifdef OLED
  Adafruit_SSD1306 display(128, 32, &Wire, -1);
#endif

uint16_t numWdtCounter;
uint16_t numRstCounter;
uint16_t lblNetStaNetworksAvail;
uint16_t lblNetStaBroadcast;
uint16_t lblNetApBroadcast;
String strListNetworksAvail = "";
uint16_t txtNetStaIPAddr;
uint16_t txtNetStaSubnetAddr;
uint16_t txtNetStaGatewayAddr;
uint16_t numNetApDelay;
uint16_t numPixelsA;
uint16_t selPixelModeA;
uint16_t numPixelFxStartChA;
uint16_t numPixelsB;
uint16_t selPixelModeB;
uint16_t numPixelFxStartChB;

void handleUpdate(AsyncWebServerRequest *request) {
  char html[] = "<form method='POST' action='/doUpdate' enctype='multipart/form-data'><input type='file' name='update'><input type='submit' value='Update'></form>";
  request->send(200, "text/html", html);
}

void handleDoUpdate(AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
    #ifdef DEBUG
      Serial.println("Update");
    #endif
    size_t content_len = request->contentLength();
    // if filename includes spiffs, update the spiffs partition
    int cmd = (filename.indexOf("spiffs") > -1) ? U_FS : U_FLASH;
    Update.runAsync(true);
    if (!Update.begin(content_len, cmd)) {
      #ifdef DEBUG
        Update.printError(Serial);
      #endif
    }
  }

#ifdef DEBUG
  if (Update.write(data, len) != len) {
    Update.printError(Serial);
  } else {
    Serial.printf("Progress: %d%%\n", (Update.progress()*100)/Update.size());
  }
#endif

  if (final) {
    AsyncWebServerResponse *response = request->beginResponse(302, "text/plain", "Please wait while the device reboots");
    response->addHeader("Refresh", "20");  
    response->addHeader("Location", "/");
    request->send(response);
    if (!Update.end(true)) {
      #ifdef DEBUG
        Update.printError(Serial);
      #endif
    } else {
      #ifdef DEBUG
        Serial.println("Update complete");
        Serial.flush();
      #endif
      // ESP.restart();
      doReboot = true;
    }
  }
}

/* ---------------- Number callbacks ---------------- */

void cbNumNetApDelay(Control* sender, int type) {
  uint16_t val = (uint16_t)(sender->value.toInt());
  if (val > 180) {
    val = 180;
  }
  config.net_ap_delay = val;
}

void cbNumNetPortA(Control* sender, int type) {
  uint8_t val = (uint8_t)(sender->value.toInt());
  if (val > 127) {
    val = 127;
  }
  config.portA_net = val;
}

void cbNumSubnetPortA(Control* sender, int type) {
  uint8_t val = (uint8_t)(sender->value.toInt());
  if (val > 15) {
    val = 15;
  }
  config.portA_subnet = val;
}

void cbNumPixelsPortA(Control* sender, int type) {
  uint16_t val = (uint16_t)(sender->value.toInt());
  if (val > 680) {
    val = 680;
  }
  config.portA_pixel_count = val;
}

void cbNumPixelFxStartChPortA(Control* sender, int type) {
  uint16_t val = (uint16_t)(sender->value.toInt());
  if (val > 501) {
    val = 501;
  } else if (val < 1) {
    val = 1;
  }
  config.portA_pixel_startFX = val;
}

#ifndef SOLE_OUTPUT
void cbNumNetPortB(Control* sender, int type) {
  uint8_t val = (uint8_t)(sender->value.toInt());
  if (val > 127) {
    val = 127;
  }
  config.portB_net = val;
}

void cbNumSubnetPortB(Control* sender, int type) {
  uint8_t val = (uint8_t)(sender->value.toInt());
  if (val > 15) {
    val = 15;
  }
  config.portB_subnet = val;
}

void cbNumPixelsPortB(Control* sender, int type) {
  uint16_t val = (uint16_t)(sender->value.toInt());
  if (val > 680) {
    val = 680;
  }
  config.portB_pixel_count = val;
}

void cbNumPixelFxStartChPortB(Control* sender, int type) {
  uint16_t val = (uint16_t)(sender->value.toInt());
  if (val > 501) {
    val = 501;
  } else if (val < 1) {
    val = 1;
  }
  config.portB_pixel_startFX = val;
}
#endif

/* -------------- Number callbacks end -------------- */

/* ------------ Number extended callbacks ----------- */

void cbNumUniversePortA(Control* sender, int type, void* param) {
  uint8_t val = (uint8_t)(sender->value.toInt());
  if (val > 15) {
    val = 15;
  }
  config.portA_uni[(int)param] = val;
}

void cbNumSACNUniversePortA(Control* sender, int type, void* param) {
  uint16_t val = (uint16_t)(sender->value.toInt());
  if (val > 63999) {
    val = 63999;
  } else if (((int)param > 0) && (val < 1)) {
    val = 1;
  }
  config.portA_SACNuni[(int)param] = val;
}

#ifndef SOLE_OUTPUT
void cbNumUniversePortB(Control* sender, int type, void* param) {
  uint8_t val = (uint8_t)(sender->value.toInt());
  if (val > 15) {
    val = 15;
  }
  config.portB_uni[(int)param] = val;
}

void cbNumSACNUniversePortB(Control* sender, int type, void* param) {
  uint16_t val = (uint16_t)(sender->value.toInt());
  if (val > 63999) {
    val = 63999;
  } else if (((int)param > 0) && (val < 1)) {
    val = 1;
  }
  config.portB_SACNuni[(int)param] = val;
}
#endif

/* --------- Number extended callbacks end --------- */

/* ----------------- Text callbacks ---------------- */

void cbTxtNodeName(Control* sender, int type) {
  strlcpy(config.gen_nodeName, sender->value.c_str(), 18);
}

void cbTxtLongName(Control* sender, int type) {
  strlcpy(config.gen_longName, sender->value.c_str(), 64);
}

void cbTxtNetStaSSID(Control* sender, int type) {
  strlcpy(config.net_sta_ssid, sender->value.c_str(), 32);
}

void cbTxtNetStaPwd(Control* sender, int type) {
  // min. 8, max. 64 characters
  if (sender->value.length() < 8) {
    strcpy(config.net_sta_password, "");
  } else {
    strlcpy(config.net_sta_password, sender->value.c_str(), 64);
  }
}

void cbTxtNetStaIP(Control* sender, int type) {
  config.net_sta_ip.fromString(sender->value.c_str());
  config.net_sta_broadcast = {
    (uint8_t)((~config.net_sta_subnet[0]) | (config.net_sta_ip[0] & config.net_sta_subnet[0])), 
    (uint8_t)((~config.net_sta_subnet[1]) | (config.net_sta_ip[1] & config.net_sta_subnet[1])), 
    (uint8_t)((~config.net_sta_subnet[2]) | (config.net_sta_ip[2] & config.net_sta_subnet[2])), 
    (uint8_t)((~config.net_sta_subnet[3]) | (config.net_sta_ip[3] & config.net_sta_subnet[3]))  
  };
  ESPUI.updateLabel(lblNetStaBroadcast, config.net_sta_broadcast.toString());
}

void cbTxtNetStaSubnet(Control* sender, int type) {
  config.net_sta_subnet.fromString(sender->value.c_str());
  config.net_sta_broadcast = {
    (uint8_t)((~config.net_sta_subnet[0]) | (config.net_sta_ip[0] & config.net_sta_subnet[0])), 
    (uint8_t)((~config.net_sta_subnet[1]) | (config.net_sta_ip[1] & config.net_sta_subnet[1])), 
    (uint8_t)((~config.net_sta_subnet[2]) | (config.net_sta_ip[2] & config.net_sta_subnet[2])), 
    (uint8_t)((~config.net_sta_subnet[3]) | (config.net_sta_ip[3] & config.net_sta_subnet[3]))  
  };
  ESPUI.updateLabel(lblNetStaBroadcast, config.net_sta_broadcast.toString());
}

void cbTxtNetStaGateway(Control* sender, int type) {
  config.net_sta_gateway.fromString(sender->value.c_str());
}

