DJMaxergy/ESP32_ArtNetNode/src/main.cpp
void cbTxtNetApSSID(Control* sender, int type) {
  strlcpy(config.net_ap_ssid, sender->value.c_str(), 32);
}

void cbTxtNetApPwd(Control* sender, int type) {
  // min. 8, max. 64 characters
  if (sender->value.length() < 8) {
    strcpy(config.net_ap_password, "");
  } else {
    strlcpy(config.net_ap_password, sender->value.c_str(), 64);
  }
}

void cbTxtNetApIP(Control* sender, int type) {
  config.net_ap_ip.fromString(sender->value.c_str());
  config.net_ap_broadcast = {
    (uint8_t)((~config.net_ap_subnet[0]) | (config.net_ap_ip[0] & config.net_ap_subnet[0])), 
    (uint8_t)((~config.net_ap_subnet[1]) | (config.net_ap_ip[1] & config.net_ap_subnet[1])), 
    (uint8_t)((~config.net_ap_subnet[2]) | (config.net_ap_ip[2] & config.net_ap_subnet[2])), 
    (uint8_t)((~config.net_ap_subnet[3]) | (config.net_ap_ip[3] & config.net_ap_subnet[3]))  
  };
  ESPUI.updateLabel(lblNetApBroadcast, config.net_ap_broadcast.toString());
}

void cbTxtNetApSubnet(Control* sender, int type) {
  config.net_ap_subnet.fromString(sender->value.c_str());
  config.net_ap_broadcast = {
    (uint8_t)((~config.net_ap_subnet[0]) | (config.net_ap_ip[0] & config.net_ap_subnet[0])), 
    (uint8_t)((~config.net_ap_subnet[1]) | (config.net_ap_ip[1] & config.net_ap_subnet[1])), 
    (uint8_t)((~config.net_ap_subnet[2]) | (config.net_ap_ip[2] & config.net_ap_subnet[2])), 
    (uint8_t)((~config.net_ap_subnet[3]) | (config.net_ap_ip[3] & config.net_ap_subnet[3]))  
  };
  ESPUI.updateLabel(lblNetApBroadcast, config.net_ap_broadcast.toString());
}

void cbTxtNetDmxIn(Control* sender, int type) {
  config.net_dmxIn_broadcast.fromString(sender->value.c_str());
}

/* --------------- Text callbacks end -------------- */

/* ---------------- Button callbacks ---------------- */

void cbBtnReboot(Control* sender, int type) {
  switch (type) {
    case B_DOWN:
      break;
    case B_UP:
      delay(500);
      doReboot = true;
      break;
  }
}

void cbBtnSaveConfig(Control* sender, int type) {
  switch (type) {
    case B_DOWN:
      break;
    case B_UP:
      #ifdef DEBUG
        Serial.println("Button UP - Saving Configuration...");
      #endif
      config_save();
      break;
  }
}

void cbBtnResetConfig(Control* sender, int type) {
  switch (type) {
    case B_DOWN:
      break;
    case B_UP:
      #ifdef DEBUG
        Serial.println("Button UP - Resetting Configuration...");
      #endif
      config_init();
      config_save();
      delay(500);
      doReboot = true;
      break;
  }
}

/* -------------- Button callbacks end -------------- */

/* ---------------- Switch callbacks ---------------- */

void cbSwNetStaDHCP(Control* sender, int value) {
  switch (value) {
    case S_ACTIVE:
        config.net_sta_dhcp = true;
        ESPUI.setEnabled(txtNetStaIPAddr, false);
        ESPUI.setEnabled(txtNetStaSubnetAddr, false);
        ESPUI.setEnabled(txtNetStaGatewayAddr, false);
        if (config.net_ap_standalone == false) {
          ESPUI.setEnabled(numNetApDelay, true);
        }
        break;
    case S_INACTIVE:
        config.net_sta_dhcp = false;
        ESPUI.setEnabled(txtNetStaIPAddr, true);
        ESPUI.setEnabled(txtNetStaSubnetAddr, true);
        ESPUI.setEnabled(txtNetStaGatewayAddr, true);
        if (config.net_ap_standalone == false) {
          ESPUI.setEnabled(numNetApDelay, false);
        }
        break;
  }
}

void cbSwNetApStandalone(Control* sender, int value) {
  switch (value) {
    case S_ACTIVE:
        config.net_ap_standalone = true;
        if (config.net_sta_dhcp == true) {
          ESPUI.setEnabled(numNetApDelay, false);
        }
        break;
    case S_INACTIVE:
        config.net_ap_standalone = false;
        if (config.net_sta_dhcp == true) {
          ESPUI.setEnabled(numNetApDelay, true);
        }
        break;
  }
}

/* -------------- Switch callbacks end -------------- */

/* ---------------- Select callbacks ---------------- */

void cbSelModePortA(Control* sender, int value) {
  config.portA_mode = (uint8_t)(sender->value.toInt());
  if (config.portA_mode == PORT_TYPE_WS2812) {
    // ESPUI.updateVisibility(numPixelsA, true);
    // ESPUI.updateVisibility(selPixelModeA, true);
    // ESPUI.updateVisibility(numPixelFxStartChA, true);
    ESPUI.setEnabled(numPixelsA, true);
    ESPUI.setEnabled(selPixelModeA, true);
    ESPUI.setEnabled(numPixelFxStartChA, true);
  } else {
    // ESPUI.updateVisibility(numPixelsA, false);
    // ESPUI.updateVisibility(selPixelModeA, false);
    // ESPUI.updateVisibility(numPixelFxStartChA, false);
    ESPUI.setEnabled(numPixelsA, false);
    ESPUI.setEnabled(selPixelModeA, false);
    ESPUI.setEnabled(numPixelFxStartChA, false);
  }
}

void cbSelProtPortA(Control* sender, int value) {
  config.portA_prot = (uint8_t)(sender->value.toInt());
}

void cbSelMergePortA(Control* sender, int value) {
  config.portA_merge = (uint8_t)(sender->value.toInt());
}

void cbSelPixelModePortA(Control* sender, int value) {
  config.portA_pixel_mode = (uint8_t)(sender->value.toInt());
}

#ifndef SOLE_OUTPUT
void cbSelModePortB(Control* sender, int value) {
  config.portB_mode = (uint8_t)(sender->value.toInt());
  if (config.portB_mode == PORT_TYPE_WS2812) {
    // ESPUI.updateVisibility(numPixelsB, true);
    // ESPUI.updateVisibility(selPixelModeB, true);
    // ESPUI.updateVisibility(numPixelFxStartChB, true);
    ESPUI.setEnabled(numPixelsB, true);
    ESPUI.setEnabled(selPixelModeB, true);
    ESPUI.setEnabled(numPixelFxStartChB, true);
  } else {
    // ESPUI.updateVisibility(numPixelsB, false);
    // ESPUI.updateVisibility(selPixelModeB, false);
    // ESPUI.updateVisibility(numPixelFxStartChB, false);
    ESPUI.setEnabled(numPixelsB, false);
    ESPUI.setEnabled(selPixelModeB, false);
    ESPUI.setEnabled(numPixelFxStartChB, false);
  }
}

void cbSelProtPortB(Control* sender, int value) {
  config.portB_prot = (uint8_t)(sender->value.toInt());
}

void cbSelMergePortB(Control* sender, int value) {
  config.portB_merge = (uint8_t)(sender->value.toInt());
}

void cbSelPixelModePortB(Control* sender, int value) {
  config.portB_pixel_mode = (uint8_t)(sender->value.toInt());
}
#endif

/* -------------- Select callbacks end -------------- */

