DJMaxergy/ESP32_ArtNetNode/src/main.cpp
/* ----------------- Tab callbacks ----------------- */

void cbNetworkScanComplete(int count) {
  strListNetworksAvail = "";
  for (int i = 0; i < count; i++) {
    strListNetworksAvail = strListNetworksAvail + WiFi.SSID(i) + " (" + WiFi.RSSI(i) + " dBm)" + "<br>";
  }
  ESPUI.updateLabel(lblNetStaNetworksAvail, strListNetworksAvail);
}

void cbTabStation(Control* sender, int type) {
  WiFi.scanNetworksAsync(cbNetworkScanComplete);
}

/* --------------- Tab callbacks end -------------- */

/* ############### Init functions ############### */

void initWebServer() {
  yield();

  // Disable captive portal when access point is not started
  if (accessPointStarted == false) {
    ESPUI.captivePortal = false;
  }
  #ifdef DEBUG
    ESPUI.setVerbosity(Verbosity::VerboseJSON);
  #endif

  ESPUI.jsonUpdateDocumentSize = 2000;
  ESPUI.jsonInitialDocumentSize = 6000; // needs to be reduced in order to get content shown on ESP8266

  // Tabs:
  uint16_t tabHome = ESPUI.addControl(ControlType::Tab, "TbHome", "Home");
  uint16_t tabMonitor = ESPUI.addControl(ControlType::Tab, "TbMonitor", "Monitor");
  uint16_t tabNode = ESPUI.addControl(ControlType::Tab, "TbNode", "Node Config");
  uint16_t tabStation = ESPUI.addControl(ControlType::Tab, "TbStation", "Network Config", ControlColor::None, 0, cbTabStation);
  uint16_t tabAp = ESPUI.addControl(ControlType::Tab, "TbAP", "AP Config");
  uint16_t tabDmxIn = ESPUI.addControl(ControlType::Tab, "TbDmxIn", "DMX Input Config");
  uint16_t tabPortA = ESPUI.addControl(ControlType::Tab, "TbPortA", "Port A");
  #ifndef SOLE_OUTPUT
  uint16_t tabPortB = ESPUI.addControl(ControlType::Tab, "TbPortB", "Port B");
  #endif
  uint16_t tabUpdate = ESPUI.addControl(ControlType::Tab, "TbUpdate", "Update");
  // Home Tab content:
  // Info:
  ESPUI.addControl(ControlType::Label, "Version", configActive.gen_version, ControlColor::Peterriver, tabHome);
  ESPUI.addControl(ControlType::Label, "Node Name", configActive.gen_nodeName, ControlColor::Peterriver, tabHome);
  ESPUI.addControl(ControlType::Label, "MAC Address", macAddr_str, ControlColor::Emerald, tabHome);
  ESPUI.addControl(ControlType::Label, "Wifi Status", wifiStatus, ControlColor::Emerald, tabHome);
  if (configActive.net_ap_standalone == false && configActive.net_sta_ssid[0] != '\0') {
    ESPUI.addControl(ControlType::Label, "IP Address (Station)", configActive.net_sta_ip.toString(), ControlColor::Emerald, tabHome);
  } else {
    ESPUI.addControl(ControlType::Label, "IP Address (Access Point)", configActive.net_ap_ip.toString(), ControlColor::Emerald, tabHome);
  }
  // Actions:
  uint16_t btnGroupActions = ESPUI.addControl(ControlType::Button, "Actions", "Reboot", ControlColor::Alizarin, tabHome, cbBtnReboot);
  ESPUI.addControl(ControlType::Button, "", "Save Config", ControlColor::Alizarin, btnGroupActions, cbBtnSaveConfig);
  ESPUI.addControl(ControlType::Button, "", "Reset Config", ControlColor::Alizarin, btnGroupActions, cbBtnResetConfig);
  // Monitor Tab content:
  numWdtCounter = ESPUI.addControl(ControlType::Number, "Watchdog counter", String(configActive.wdtCounter), ControlColor::Wetasphalt, tabMonitor);
  ESPUI.setEnabled(numWdtCounter, false);
  numRstCounter = ESPUI.addControl(ControlType::Number, "Reset counter", String(configActive.resetCounter), ControlColor::Wetasphalt, tabMonitor);
  ESPUI.setEnabled(numRstCounter, false);
  // Node Config Tab content:
  uint16_t txtNodeName = ESPUI.addControl(ControlType::Text, "Short Name", configActive.gen_nodeName, ControlColor::Peterriver, tabNode, cbTxtNodeName);
	ESPUI.addControl(Max, "", "18", None, txtNodeName);
  uint16_t txtLongName = ESPUI.addControl(ControlType::Text, "Long Name", configActive.gen_longName, ControlColor::Peterriver, tabNode, cbTxtLongName);
  ESPUI.addControl(Max, "", "64", None, txtLongName);
  // Network Config Tab content:
  lblNetStaNetworksAvail = ESPUI.addControl(ControlType::Label, "List of available networks", strListNetworksAvail, ControlColor::Emerald, tabStation);
  uint16_t txtNetStaSSID = ESPUI.addControl(ControlType::Text, "SSID", configActive.net_sta_ssid, ControlColor::Emerald, tabStation, cbTxtNetStaSSID);
  ESPUI.addControl(Max, "", "32", None, txtNetStaSSID);
  uint16_t txtNetStaPwd = ESPUI.addControl(ControlType::Text, "Password", configActive.net_sta_password, ControlColor::Emerald, tabStation, cbTxtNetStaPwd);
  ESPUI.setInputType(txtNetStaPwd, "password");
  ESPUI.addControl(Min, "", "8", None, txtNetStaPwd);
  ESPUI.addControl(Min, "", "64", None, txtNetStaPwd);
  ESPUI.addControl(ControlType::Switcher, "DHCP", configActive.net_sta_dhcp ? "1" : "0", ControlColor::Emerald, tabStation, cbSwNetStaDHCP);
  txtNetStaIPAddr = ESPUI.addControl(ControlType::Text, "IP Address", configActive.net_sta_ip.toString(), ControlColor::Emerald, tabStation, cbTxtNetStaIP);
  txtNetStaSubnetAddr = ESPUI.addControl(ControlType::Text, "Subnet Address", configActive.net_sta_subnet.toString(), ControlColor::Emerald, tabStation, cbTxtNetStaSubnet);
  txtNetStaGatewayAddr = ESPUI.addControl(ControlType::Text, "Gateway Address", configActive.net_sta_gateway.toString(), ControlColor::Emerald, tabStation, cbTxtNetStaGateway);
  lblNetStaBroadcast = ESPUI.addControl(ControlType::Label, "Broadcast Address", configActive.net_sta_broadcast.toString(), ControlColor::Emerald, tabStation);
  if (configActive.net_sta_dhcp == true) {
    ESPUI.setEnabled(txtNetStaIPAddr, false);
    ESPUI.setEnabled(txtNetStaSubnetAddr, false);
    ESPUI.setEnabled(txtNetStaGatewayAddr, false);
  }
  // AP Config Tab content:
  uint16_t txtNetApSSID = ESPUI.addControl(ControlType::Text, "SSID", configActive.net_ap_ssid, ControlColor::Turquoise, tabAp, cbTxtNetApSSID);
  ESPUI.addControl(Max, "", "32", None, txtNetApSSID);
  uint16_t txtNetApPwd = ESPUI.addControl(ControlType::Text, "Password", configActive.net_ap_password, ControlColor::Turquoise, tabAp, cbTxtNetApPwd);
  ESPUI.setInputType(txtNetApPwd, "password");
  ESPUI.addControl(Min, "", "8", None, txtNetApPwd);
  ESPUI.addControl(Min, "", "64", None, txtNetApPwd);
  ESPUI.addControl(ControlType::Text, "IP Address", configActive.net_ap_ip.toString(), ControlColor::Turquoise, tabAp, cbTxtNetApIP);
  ESPUI.addControl(ControlType::Text, "Subnet Address", configActive.net_ap_subnet.toString(), ControlColor::Turquoise, tabAp, cbTxtNetApSubnet);
  lblNetApBroadcast = ESPUI.addControl(ControlType::Label, "Broadcast Address", configActive.net_ap_broadcast.toString(), ControlColor::Turquoise, tabAp);
  ESPUI.addControl(ControlType::Switcher, "Standalone", configActive.net_ap_standalone ? "1" : "0", ControlColor::Turquoise, tabAp, cbSwNetApStandalone);
  numNetApDelay = ESPUI.addControl(ControlType::Number, "Start Delay [s]", String(configActive.net_ap_delay), ControlColor::Turquoise, tabAp, cbNumNetApDelay);
  ESPUI.addControl(Min, "", "0", None, numNetApDelay);
	ESPUI.addControl(Max, "", "180", None, numNetApDelay);
  if ((configActive.net_ap_standalone == true) || (configActive.net_sta_dhcp == false)) {
    ESPUI.setEnabled(numNetApDelay, false);
  }
  // DMX Input Config Tab content:
  ESPUI.addControl(ControlType::Text, "Broadcast Address", configActive.net_dmxIn_broadcast.toString(), ControlColor::Dark, tabDmxIn, cbTxtNetDmxIn);
  yield();
  // Port A Tab content:
  uint16_t selModeA = ESPUI.addControl(ControlType::Select, "Mode", String(configActive.portA_mode), ControlColor::Sunflower, tabPortA, cbSelModePortA);
  ESPUI.addControl(ControlType::Option, "DMX Output", "0", ControlColor::None, selModeA);
  ESPUI.addControl(ControlType::Option, "DMX Output with RDM", "1", ControlColor::None, selModeA);
  ESPUI.addControl(ControlType::Option, "DMX Input", "2", ControlColor::None, selModeA);
  ESPUI.addControl(ControlType::Option, "LED Pixels - WS2812", "3", ControlColor::None, selModeA);
  uint16_t selProtA = ESPUI.addControl(ControlType::Select, "Protocol", String(configActive.portA_prot), ControlColor::Sunflower, tabPortA, cbSelProtPortA);
  ESPUI.addControl(ControlType::Option, "Artnet v4", "0", ControlColor::None, selProtA);
  ESPUI.addControl(ControlType::Option, "Artnet v4 with sACN DMX", "1", ControlColor::None, selProtA);
  uint16_t selMergeA = ESPUI.addControl(ControlType::Select, "Merge Mode", String(configActive.portA_merge), ControlColor::Sunflower, tabPortA, cbSelMergePortA);
  ESPUI.addControl(ControlType::Option, "Merge LTP", "0", ControlColor::None, selMergeA);
  ESPUI.addControl(ControlType::Option, "Merge HTP", "1", ControlColor::None, selMergeA);
  uint16_t numNetA = ESPUI.addControl(ControlType::Number, "Net", String(configActive.portA_net), ControlColor::Sunflower, tabPortA, cbNumNetPortA);
  ESPUI.addControl(Min, "", "0", None, numNetA);
	ESPUI.addControl(Max, "", "127", None, numNetA);
  uint16_t numSubnetA = ESPUI.addControl(ControlType::Number, "Subnet", String(configActive.portA_subnet), ControlColor::Sunflower, tabPortA, cbNumSubnetPortA);
  ESPUI.addControl(Min, "", "0", None, numSubnetA);
	ESPUI.addControl(Max, "", "15", None, numSubnetA);
  uint16_t numGroupUniverseA = ESPUI.addControl(ControlType::Number, "Universe", String(configActive.portA_uni[0]), ControlColor::Sunflower, tabPortA, cbNumUniversePortA, (void*)0);
	ESPUI.addControl(Min, "", "0", None, numGroupUniverseA);
	ESPUI.addControl(Max, "", "15", None, numGroupUniverseA);
  uint16_t numUniverseA1 = ESPUI.addControl(ControlType::Number, "", String(configActive.portA_uni[1]), ControlColor::Sunflower, numGroupUniverseA, cbNumUniversePortA, (void*)1);
	ESPUI.addControl(Min, "", "0", None, numUniverseA1);
	ESPUI.addControl(Max, "", "15", None, numUniverseA1);
  uint16_t numUniverseA2 = ESPUI.addControl(ControlType::Number, "", String(configActive.portA_uni[2]), ControlColor::Sunflower, numGroupUniverseA, cbNumUniversePortA, (void*)2);
	ESPUI.addControl(Min, "", "0", None, numUniverseA2);
	ESPUI.addControl(Max, "", "15", None, numUniverseA2);
  uint16_t numUniverseA3 = ESPUI.addControl(ControlType::Number, "", String(configActive.portA_uni[3]), ControlColor::Sunflower, numGroupUniverseA, cbNumUniversePortA, (void*)3);
  ESPUI.addControl(Min, "", "0", None, numUniverseA3);
	ESPUI.addControl(Max, "", "15", None, numUniverseA3);
  uint16_t numGroupSACNUniverseA = ESPUI.addControl(ControlType::Number, "sACN Universe", String(configActive.portA_SACNuni[0]), ControlColor::Sunflower, tabPortA, cbNumSACNUniversePortA, (void*)0);
	ESPUI.addControl(Min, "", "0", None, numGroupSACNUniverseA);
	ESPUI.addControl(Max, "", "63999", None, numGroupSACNUniverseA);
  uint16_t numSACNUniverseA1 = ESPUI.addControl(ControlType::Number, "", String(configActive.portA_SACNuni[1]), ControlColor::Sunflower, numGroupSACNUniverseA, cbNumSACNUniversePortA, (void*)1);
	ESPUI.addControl(Min, "", "1", None, numSACNUniverseA1);
	ESPUI.addControl(Max, "", "63999", None, numSACNUniverseA1);
  uint16_t numSACNUniverseA2 = ESPUI.addControl(ControlType::Number, "", String(configActive.portA_SACNuni[2]), ControlColor::Sunflower, numGroupSACNUniverseA, cbNumSACNUniversePortA, (void*)2);
	ESPUI.addControl(Min, "", "1", None, numSACNUniverseA2);
	ESPUI.addControl(Max, "", "63999", None, numSACNUniverseA2);
  uint16_t numSACNUniverseA3 = ESPUI.addControl(ControlType::Number, "", String(configActive.portA_SACNuni[3]), ControlColor::Sunflower, numGroupSACNUniverseA, cbNumSACNUniversePortA, (void*)3);
  ESPUI.addControl(Min, "", "1", None, numSACNUniverseA3);
	ESPUI.addControl(Max, "", "63999", None, numSACNUniverseA3);
  numPixelsA = ESPUI.addControl(ControlType::Number, "Number of pixels (680 max - 170 per universe)", String(configActive.portA_pixel_count), ControlColor::Sunflower, tabPortA, cbNumPixelsPortA);
  ESPUI.addControl(Min, "", "0", None, numPixelsA);
	ESPUI.addControl(Max, "", "680", None, numPixelsA);
  selPixelModeA = ESPUI.addControl(ControlType::Select, "Pixel mode", String(configActive.portA_pixel_mode), ControlColor::Sunflower, tabPortA, cbSelPixelModePortA);
  ESPUI.addControl(ControlType::Option, "Pixel Mapping", "0", ControlColor::None, selPixelModeA);
  ESPUI.addControl(ControlType::Option, "12 Channel FX", "1", ControlColor::None, selPixelModeA);
  numPixelFxStartChA = ESPUI.addControl(ControlType::Number, "Start channel (FX modes only)", String(configActive.portA_pixel_startFX), ControlColor::Sunflower, tabPortA, cbNumPixelFxStartChPortA);
  ESPUI.addControl(Min, "", "1", None, numPixelFxStartChA);
	ESPUI.addControl(Max, "", "501", None, numPixelFxStartChA);
  if (configActive.portA_mode != PORT_TYPE_WS2812) {
    // ESPUI.updateVisibility(numPixelsA, false);
    // ESPUI.updateVisibility(selPixelModeA, false);
    // ESPUI.updateVisibility(numPixelFxStartChA, false);
    ESPUI.setEnabled(numPixelsA, false);
    ESPUI.setEnabled(selPixelModeA, false);
    ESPUI.setEnabled(numPixelFxStartChA, false);
  }
  yield();
  // Port B Tab content:
  #ifndef SOLE_OUTPUT
  uint16_t selModeB = ESPUI.addControl(ControlType::Select, "Mode", String(configActive.portB_mode), ControlColor::Carrot, tabPortB, cbSelModePortB);
  ESPUI.addControl(ControlType::Option, "DMX Output", "0", ControlColor::None, selModeB);
  ESPUI.addControl(ControlType::Option, "DMX Output with RDM", "1", ControlColor::None, selModeB);
  // ESPUI.addControl(ControlType::Option, "DMX Input", "2", ControlColor::None, selModeB); // Not possible, so disable it
  ESPUI.addControl(ControlType::Option, "LED Pixels - WS2812", "3", ControlColor::None, selModeB);
  uint16_t selProtB = ESPUI.addControl(ControlType::Select, "Protocol", String(configActive.portB_prot), ControlColor::Carrot, tabPortB, cbSelProtPortB);
  ESPUI.addControl(ControlType::Option, "Artnet v4", "0", ControlColor::None, selProtB);
  ESPUI.addControl(ControlType::Option, "Artnet v4 with sACN DMX", "1", ControlColor::None, selProtB);
  uint16_t selMergeB = ESPUI.addControl(ControlType::Select, "Merge Mode", String(configActive.portB_merge), ControlColor::Carrot, tabPortB, cbSelMergePortB);
  ESPUI.addControl(ControlType::Option, "Merge LTP", "0", ControlColor::None, selMergeB);
  ESPUI.addControl(ControlType::Option, "Merge HTP", "1", ControlColor::None, selMergeB);
  uint16_t numNetB = ESPUI.addControl(ControlType::Number, "Net", String(configActive.portB_net), ControlColor::Carrot, tabPortB, cbNumNetPortB);
  ESPUI.addControl(Min, "", "0", None, numNetB);
	ESPUI.addControl(Max, "", "127", None, numNetB);
  uint16_t numSubnetB = ESPUI.addControl(ControlType::Number, "Subnet", String(configActive.portB_subnet), ControlColor::Carrot, tabPortB, cbNumSubnetPortB);
  ESPUI.addControl(Min, "", "0", None, numSubnetB);
	ESPUI.addControl(Max, "", "15", None, numSubnetB);
  uint16_t numGroupUniverseB = ESPUI.addControl(ControlType::Number, "Universe", String(configActive.portB_uni[0]), ControlColor::Carrot, tabPortB, cbNumUniversePortB, (void*)0);
  ESPUI.addControl(Min, "", "0", None, numGroupUniverseB);
	ESPUI.addControl(Max, "", "15", None, numGroupUniverseB);
	uint16_t numUniverseB1 = ESPUI.addControl(ControlType::Number, "", String(configActive.portB_uni[1]), ControlColor::Carrot, numGroupUniverseB, cbNumUniversePortB, (void*)1);
  ESPUI.addControl(Min, "", "0", None, numUniverseB1);
	ESPUI.addControl(Max, "", "15", None, numUniverseB1);
	uint16_t numUniverseB2 = ESPUI.addControl(ControlType::Number, "", String(configActive.portB_uni[2]), ControlColor::Carrot, numGroupUniverseB, cbNumUniversePortB, (void*)2);
  ESPUI.addControl(Min, "", "0", None, numUniverseB2);
	ESPUI.addControl(Max, "", "15", None, numUniverseB2);
	uint16_t numUniverseB3 = ESPUI.addControl(ControlType::Number, "", String(configActive.portB_uni[3]), ControlColor::Carrot, numGroupUniverseB, cbNumUniversePortB, (void*)3);
  ESPUI.addControl(Min, "", "0", None, numUniverseB3);
	ESPUI.addControl(Max, "", "15", None, numUniverseB3);
  uint16_t numGroupSACNUniverseB = ESPUI.addControl(ControlType::Number, "sACN Universe", String(configActive.portB_SACNuni[0]), ControlColor::Carrot, tabPortB, cbNumSACNUniversePortB, (void*)0);
	ESPUI.addControl(Min, "", "0", None, numGroupSACNUniverseB);
	ESPUI.addControl(Max, "", "63999", None, numGroupSACNUniverseB);
  uint16_t numSACNUniverseB1 = ESPUI.addControl(ControlType::Number, "", String(configActive.portB_SACNuni[1]), ControlColor::Carrot, numGroupSACNUniverseB, cbNumSACNUniversePortB, (void*)1);
	ESPUI.addControl(Min, "", "1", None, numSACNUniverseB1);
	ESPUI.addControl(Max, "", "63999", None, numSACNUniverseB1);
  uint16_t numSACNUniverseB2 = ESPUI.addControl(ControlType::Number, "", String(configActive.portB_SACNuni[2]), ControlColor::Carrot, numGroupSACNUniverseB, cbNumSACNUniversePortB, (void*)2);
	ESPUI.addControl(Min, "", "1", None, numSACNUniverseB2);
	ESPUI.addControl(Max, "", "63999", None, numSACNUniverseB2);
  uint16_t numSACNUniverseB3 = ESPUI.addControl(ControlType::Number, "", String(configActive.portB_SACNuni[3]), ControlColor::Carrot, numGroupSACNUniverseB, cbNumSACNUniversePortB, (void*)3);
  ESPUI.addControl(Min, "", "1", None, numSACNUniverseB3);
	ESPUI.addControl(Max, "", "63999", None, numSACNUniverseB3);
  numPixelsB = ESPUI.addControl(ControlType::Number, "Number of pixels (680 max - 170 per universe)", String(configActive.portB_pixel_count), ControlColor::Carrot, tabPortB, cbNumPixelsPortB);
  ESPUI.addControl(Min, "", "0", None, numPixelsB);
	ESPUI.addControl(Max, "", "680", None, numPixelsB);
  selPixelModeB = ESPUI.addControl(ControlType::Select, "Pixel mode", String(configActive.portB_pixel_mode), ControlColor::Carrot, tabPortB, cbSelPixelModePortB);
  ESPUI.addControl(ControlType::Option, "Pixel Mapping", "0", ControlColor::None, selPixelModeB);
  ESPUI.addControl(ControlType::Option, "12 Channel FX", "1", ControlColor::None, selPixelModeB);
  numPixelFxStartChB = ESPUI.addControl(ControlType::Number, "Start channel (FX modes only)", String(configActive.portB_pixel_startFX), ControlColor::Carrot, tabPortB, cbNumPixelFxStartChPortB);
  ESPUI.addControl(Min, "", "1", None, numPixelFxStartChB);
	ESPUI.addControl(Max, "", "501", None, numPixelFxStartChB);
  if (configActive.portB_mode != PORT_TYPE_WS2812) {
    // ESPUI.updateVisibility(numPixelsB, false);
    // ESPUI.updateVisibility(selPixelModeB, false);
    // ESPUI.updateVisibility(numPixelFxStartChB, false);
    ESPUI.setEnabled(numPixelsB, false);
    ESPUI.setEnabled(selPixelModeB, false);
    ESPUI.setEnabled(numPixelFxStartChB, false);
  }
  yield();
  #endif
  // Update Tab content:
  uint16_t lblUpdateHint = ESPUI.addControl(ControlType::Label, "Info", "For doing OTA updates, go to [node-ip]/update.", ControlColor::None, tabUpdate);
  ESPUI.setPanelWide(lblUpdateHint, true);

  // Initialize WebServer:
  ESPUI.begin(" ArtNetNode by DJ Maxergy (PB Matthew Tong) ");
  yield();

