DJMaxergy/ESP32_ArtNetNode/src/main.cpp
  // Add OTA Update requests:
  ESPUI.server->on("/update", HTTP_GET, [](AsyncWebServerRequest *request){handleUpdate(request);});
  ESPUI.server->on("/doUpdate", HTTP_POST,
    [](AsyncWebServerRequest *request) {},
    [](AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data,
                  size_t len, bool final) {handleDoUpdate(request, filename, index, data, len, final);}
  );

  yield();
}

void convertMACtoStr(uint8_t* macArrayPtr, char* macStringPtr) {
  sprintf(macStringPtr, "%2X:%2X:%2X:%2X:%2X:%2X", macArrayPtr[0], macArrayPtr[1], macArrayPtr[2], macArrayPtr[3], macArrayPtr[4], macArrayPtr[5]);
}

void initAP() {
  yield();

  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(configActive.net_ap_ip, configActive.net_ap_ip, configActive.net_ap_subnet);
  WiFi.softAP(configActive.net_ap_ssid, configActive.net_ap_password);
  WiFi.softAPSSID().toCharArray(configActive.net_ap_ssid, sizeof(configActive.net_ap_ssid));
  WiFi.macAddress(macAddr);
  convertMACtoStr(macAddr, macAddr_str);

  // Set broadcast address just for information on website
  configActive.net_ap_broadcast = {
    (uint8_t)((~configActive.net_ap_subnet[0]) | (configActive.net_ap_ip[0] & configActive.net_ap_subnet[0])), 
    (uint8_t)((~configActive.net_ap_subnet[1]) | (configActive.net_ap_ip[1] & configActive.net_ap_subnet[1])), 
    (uint8_t)((~configActive.net_ap_subnet[2]) | (configActive.net_ap_ip[2] & configActive.net_ap_subnet[2])), 
    (uint8_t)((~configActive.net_ap_subnet[3]) | (configActive.net_ap_ip[3] & configActive.net_ap_subnet[3]))  
  };

  sprintf(wifiStatus, "Access Point started.<br />\nSSID: %s", configActive.net_ap_ssid);
  accessPointStarted = true;

  // Start mDNS for captive portal (only relevant for access point)
  dnsServer.start(DNS_PORT, "*", configActive.net_ap_ip);

  if (configActive.net_ap_standalone == true) {
    return;
  } else {
    // Start web server
    initWebServer();

    unsigned long timeout = millis() + TIMEOUT_AP;
    // Stay here if not in stand alone mode - no dmx or artnet
    while (timeout > millis() || WiFi.softAPgetStationNum() > 0) {
      dnsServer.processNextRequest();
      yield();
    }

    accessPointStarted = false;
    delay(500);
    ESP.restart();
  }
}

void initWifi() {
  wifi_set_sleep_type(NONE_SLEEP_T);

  // If it's the default WiFi Access Point SSID or it's empty, make it unique:
  if (strcmp(configActive.net_ap_ssid, CONF_NET_AP_SSID_DEF) == 0 || configActive.net_ap_ssid[0] == '\0') {
    sprintf(configActive.net_ap_ssid, "%s_%05u", CONF_NET_AP_SSID_DEF, (ESP.getChipId() & 0xFF));
  }
  
  if (configActive.net_ap_standalone == true) {
    // If standalone mode is activated, directly start access point:
    initAP();
  } else if (configActive.net_sta_ssid[0] != '\0') {
    // If WiFi station SSID is configured, start WiFi station:
    WiFi.mode(WIFI_STA);
    WiFi.hostname(configActive.gen_nodeName);
    WiFi.begin(configActive.net_sta_ssid, configActive.net_sta_password);
    WiFi.SSID().toCharArray(configActive.net_sta_ssid, sizeof(configActive.net_sta_ssid));
    WiFi.macAddress(macAddr);
    convertMACtoStr(macAddr, macAddr_str);
    
    unsigned long timeout = millis() + (configActive.net_ap_delay * 1000);
    if (configActive.net_sta_dhcp == true) {
      // WiFi station is configured for DHCP -> wait for established connection:
      while (WiFi.status() != WL_CONNECTED && timeout > millis()) {
        yield();
      }
      
      if (millis() >= timeout) {
        // If timeout reached, start Access Point:
        initAP();
      } else {
        // WiFi station is connected:
        sprintf(wifiStatus, "Wifi connected (DHCP).<br />SSID: %s", configActive.net_sta_ssid);

        configActive.net_sta_ip = WiFi.localIP();
        configActive.net_sta_subnet = WiFi.subnetMask();
        if (configActive.net_sta_gateway == INADDR_NONE)
          configActive.net_sta_gateway = WiFi.gatewayIP();
        configActive.net_sta_broadcast = {
          (uint8_t)((~configActive.net_sta_subnet[0]) | (configActive.net_sta_ip[0] & configActive.net_sta_subnet[0])), 
          (uint8_t)((~configActive.net_sta_subnet[1]) | (configActive.net_sta_ip[1] & configActive.net_sta_subnet[1])), 
          (uint8_t)((~configActive.net_sta_subnet[2]) | (configActive.net_sta_ip[2] & configActive.net_sta_subnet[2])), 
          (uint8_t)((~configActive.net_sta_subnet[3]) | (configActive.net_sta_ip[3] & configActive.net_sta_subnet[3]))  
        };
      }
    } else {
      WiFi.config(configActive.net_sta_ip, configActive.net_sta_gateway, configActive.net_sta_subnet);
      sprintf(wifiStatus, "Wifi connected (non-DHCP).<br />SSID: %s", configActive.net_sta_ssid);
    }
  } else {
    // No WiFi station SSID configured, start access point:
    initAP();
  }

  yield();
}

void cbArtDmxReceive(uint8_t group, uint8_t port, uint16_t numChans, bool syncEnabled) {
  uint16_t maxChans = 3*LIM_PIXELS_PER_ARTNET_PORT;
  uint8_t* dmxData = artRDM.getDMX(group, port);
  uint16_t pixStartIndex = port * maxChans;
  uint16_t pixEndIndex = 0;
  uint16_t indexDmxData = 0;

  artDmxReceiving = true;

  if (portA[0] == group) {
    // WS2812 mode:
    if (configActive.portA_mode == PORT_TYPE_WS2812) {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_A, blue); //green

      // FX MAP mode:
      if (configActive.portA_pixel_mode == PIXEL_FX_MODE_MAP) {
        // Limit channels:
        if (numChans > maxChans) {
          numChans = maxChans;
        }
        
        // Copy DMX data to the pixels buffer:
        pixEndIndex = (pixStartIndex + numChans) / 3;
        indexDmxData = 0;
        if (pixPortA != NULL) {
          for (uint16_t i = pixStartIndex; i < pixEndIndex; i++) {
            pixPortA->SetPixelColor(i, RgbColor(dmxData[indexDmxData], dmxData[indexDmxData + 1], dmxData[indexDmxData + 2]));
            indexDmxData = indexDmxData + 3;
          }
        }
        
        // Output to pixel strip:
        if (!syncEnabled) {
          pixDone = false;
        }

        return;

      // FX 12 Mode:
      } else if (port == portA[1]) {
          uint16_t pixFXAddr = configActive.portA_pixel_startFX - 1;
          
          pixFXA->Intensity = dmxData[pixFXAddr + 0];
          pixFXA->setFX(dmxData[pixFXAddr + 1]);
          pixFXA->setSpeed(dmxData[pixFXAddr + 2]);
          pixFXA->Pos = dmxData[pixFXAddr + 3];
          pixFXA->Size = dmxData[pixFXAddr + 4];
          pixFXA->setColour1((dmxData[pixFXAddr + 5] << 16) | (dmxData[pixFXAddr + 6] << 8) | dmxData[pixFXAddr + 7]);
          pixFXA->setColour2((dmxData[pixFXAddr + 8] << 16) | (dmxData[pixFXAddr + 9] << 8) | dmxData[pixFXAddr + 10]);
          pixFXA->Size1 = dmxData[pixFXAddr + 11];
          //pixFXA->Fade = dmxData[pixFXAddr + 12];
          pixFXA->NewData = 1;
      }
    // DMX modes:
    } else if (configActive.portA_mode != PORT_TYPE_DMX_IN && port == portA[1]) {
      dmxA.chanUpdate(numChans);
      statusStrip.SetPixelColor(ADDR_STATUS_LED_A, blue);
    }
  #ifndef SOLE_OUTPUT
  } else if (portB[0] == group) {
    /* if (port == portB[1]) {
      dmxB.chanUpdate(numChans);
      statusStrip.SetPixelColor(ADDR_STATUS_LED_B, blue);
    } */
    // WS2812 mode:
    if (configActive.portB_mode == PORT_TYPE_WS2812) {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_B, blue); //green
      
      // FX MAP mode:
      if (configActive.portB_pixel_mode == PIXEL_FX_MODE_MAP) {
        // Limit channels:
        if (numChans > maxChans) {
          numChans = maxChans;
        }
        
        // Copy DMX data to the pixels buffer:
        pixEndIndex = (pixStartIndex + numChans) / 3;
        indexDmxData = 0;
        if (pixPortB != NULL) {
          for (uint16_t i = pixStartIndex; i < pixEndIndex; i++) {
            pixPortB->SetPixelColor(i, RgbColor(dmxData[indexDmxData], dmxData[indexDmxData + 1], dmxData[indexDmxData + 2]));
            indexDmxData = indexDmxData + 3;
          }
        }
        
        // Output to pixel strip:
        if (!syncEnabled) {
          pixDone = false;
        }

        return;

      // FX 12 mode:
      } else if (port == portB[1]) {
        uint16_t pixFXAddr = configActive.portB_pixel_startFX - 1;
        
