DJMaxergy/ESP32_ArtNetNode/src/main.cpp
        pixFXB->Intensity = dmxData[pixFXAddr + 0];
        pixFXB->setFX(dmxData[pixFXAddr + 1]);
        pixFXB->setSpeed(dmxData[pixFXAddr + 2]);
        pixFXB->Pos = dmxData[pixFXAddr + 3];
        pixFXB->Size = dmxData[pixFXAddr + 4];
        pixFXB->setColour1((dmxData[pixFXAddr + 5] << 16) | (dmxData[pixFXAddr + 6] << 8) | dmxData[pixFXAddr + 7]);
        pixFXB->setColour2((dmxData[pixFXAddr + 8] << 16) | (dmxData[pixFXAddr + 9] << 8) | dmxData[pixFXAddr + 10]);
        pixFXB->Size1 = dmxData[pixFXAddr + 11];
        //pixFXB->Fade = dmxData[pixFXAddr + 12];
        pixFXB->NewData = 1;
      }
    // DMX modes:
    } else if (configActive.portB_mode != PORT_TYPE_DMX_IN && port == portB[1]) {
      dmxB.chanUpdate(numChans);
      statusStrip.SetPixelColor(ADDR_STATUS_LED_B, blue);
    }
  #endif
  }
}

void cbArtRdmReceive(uint8_t group, uint8_t port, rdm_data* c) {
  if (portA[0] == group && portA[1] == port)
    dmxA.rdmSendCommand(c);
  #ifndef SOLE_OUTPUT
    else if (portB[0] == group && portB[1] == port)
      dmxB.rdmSendCommand(c);
  #endif
}

void cbArtSync() {
  #ifdef SOLE_OUTPUT
  if (configActive.portA_mode == PORT_TYPE_WS2812) {
    rdmPause(1);
    // pixDone = pixDriver.show();
    if (pixPortA != NULL) {
      pixPortA->Show();
      pixDone = pixPortA->CanShow();
    }
    rdmPause(0);
  } else if (configActive.portA_mode != PORT_TYPE_DMX_IN) {
    dmxA.unPause();
  }
  #else
  if (configActive.portA_mode == PORT_TYPE_WS2812 || configActive.portB_mode == PORT_TYPE_WS2812) {
    rdmPause(1);
    if (pixPortA != NULL) {
      pixPortA->Show();
      pixDone = pixPortA->CanShow();
    }
    if (pixPortB != NULL) {
      pixPortB->Show();
      pixDone |= pixPortB->CanShow();
    }
    rdmPause(0);
  } else {
    if (configActive.portA_mode != PORT_TYPE_DMX_IN) {
      dmxA.unPause();
    }
    if (configActive.portB_mode != PORT_TYPE_DMX_IN) {
      dmxB.unPause();
    }
  }
  #endif
}

void cbArtIpChanged() {
  if (artRDM.getDHCP()) {
    config.net_sta_dhcp = true;
    config.net_sta_gateway = INADDR_NONE;
  } else {
    config.net_sta_dhcp = false;
    config.net_sta_ip = artRDM.getIP();
    config.net_sta_subnet = artRDM.getSubnetMask();
    config.net_sta_gateway = config.net_sta_ip;
    config.net_sta_gateway[3] = 1;
    config.net_sta_broadcast = {
      (uint8_t)((~config.net_sta_subnet[0]) | (config.net_sta_ip[0] & config.net_sta_subnet[0])), 
      (uint8_t)((~config.net_sta_subnet[1]) | (config.net_sta_ip[1] & config.net_sta_subnet[1])), 
      (uint8_t)((~config.net_sta_subnet[2]) | (config.net_sta_ip[2] & config.net_sta_subnet[2])), 
      (uint8_t)((~config.net_sta_subnet[3]) | (config.net_sta_ip[3] & config.net_sta_subnet[3]))  
    };
  }
  
  // Store new network configuration:
  config_save();

  doReboot = true;
}

void cbArtAddressChanged() {
  memcpy(&config.gen_nodeName, artRDM.getShortName(), ARTNET_SHORT_NAME_LENGTH);
  memcpy(&config.gen_longName, artRDM.getLongName(), ARTNET_LONG_NAME_LENGTH);

  // Port A:
  config.portA_net = artRDM.getNet(portA[0]);
  config.portA_subnet = artRDM.getSubNet(portA[0]);
  config.portA_uni[0] = artRDM.getUni(portA[0], portA[1]);
  config.portA_merge = artRDM.getMerge(portA[0], portA[1]);
  if (artRDM.getE131(portA[0], portA[1]) == true) {
    config.portA_prot = PORT_PROT_ARTNET_SACN;
  } else {
    config.portA_prot = PORT_PROT_ARTNET;
  }

  // Port B:
  #ifndef SOLE_OUTPUT
    config.portB_net = artRDM.getNet(portB[0]);
    config.portB_subnet = artRDM.getSubNet(portB[0]);
    config.portB_uni[0] = artRDM.getUni(portB[0], portB[1]);
    config.portB_merge = artRDM.getMerge(portB[0], portB[1]);
    if (artRDM.getE131(portB[0], portB[1]) == true) {
      config.portB_prot = PORT_PROT_ARTNET_SACN;
    } else {
      config.portB_prot = PORT_PROT_ARTNET;
    }
  #endif
  
  // Store new address configuration:
  config_save();
}

void cbDmxSendTodA() {
  artRDM.artTODData(portA[0], portA[1], dmxA.todMan(), dmxA.todDev(), dmxA.todCount(), dmxA.todStatus());
}

void cbDmxRdmReceiveA(rdm_data* c) {
  artRDM.rdmResponse(c, portA[0], portA[1]);
}

#ifndef SOLE_OUTPUT
void cbDmxSendTodB() {
  artRDM.artTODData(portB[0], portB[1], dmxB.todMan(), dmxB.todDev(), dmxB.todCount(), dmxB.todStatus());
}

void cbDmxRdmReceiveB(rdm_data* c) {
  artRDM.rdmResponse(c, portB[0], portB[1]);
}
#endif

void cbArtTodRequest(uint8_t group, uint8_t port) {
  if (portA[0] == group && portA[1] == port)
    artRDM.artTODData(portA[0], portA[1], dmxA.todMan(), dmxA.todDev(), dmxA.todCount(), dmxA.todStatus());
  #ifndef SOLE_OUTPUT
    else if (portB[0] == group && portB[1] == port)
      artRDM.artTODData(portB[0], portB[1], dmxB.todMan(), dmxB.todDev(), dmxB.todCount(), dmxB.todStatus());
  #endif
}

void cbArtTodFlush(uint8_t group, uint8_t port) {
  if (portA[0] == group && portA[1] == port)
    dmxA.rdmDiscovery();
  #ifndef SOLE_OUTPUT
    else if (portB[0] == group && portB[1] == port)
      dmxB.rdmDiscovery();
  #endif
}

void cbDmxInputReceive(uint16_t num) {
  // Double buffer switch
  byte* tmp = dataIn;
  dataIn = dmxA.getChans();
  dmxA.setBuffer(tmp);
  
  newDmxIn = true;
}

void initArtnet() {
  bool useE131 = false;

  // Initialize ArtNet:
  if (accessPointStarted)
    artRDM.init(configActive.net_ap_ip, configActive.net_ap_subnet, true, configActive.gen_nodeName, configActive.gen_longName, CONF_ARTNET_OEM, CONF_ESTA_MAN, macAddr);
  else
    artRDM.init(configActive.net_sta_ip, configActive.net_sta_subnet, configActive.net_sta_dhcp, configActive.gen_nodeName, configActive.gen_longName, CONF_ARTNET_OEM, CONF_ESTA_MAN, macAddr);

  // Set firmware:
  artRDM.setFirmwareVersion(CONF_ART_FIRM_VER);

  // ----- Port A -----
  // Add Group:
  portA[0] = artRDM.addGroup(configActive.portA_net, configActive.portA_subnet);

  // Add Port:
  // WS2812 uses PORT_TYPE_DMX_OUT - the rest use the value assigned
  if (configActive.portA_mode == PORT_TYPE_WS2812)
    portA[1] = artRDM.addPort(portA[0], 0, configActive.portA_uni[0], PORT_TYPE_DMX_OUT, configActive.portA_merge);
  else
    portA[1] = artRDM.addPort(portA[0], 0, configActive.portA_uni[0], configActive.portA_mode, configActive.portA_merge);

  // Set E131:
  useE131 = (configActive.portA_prot == PORT_PROT_ARTNET_SACN) ? true : false;
  artRDM.setE131(portA[0], portA[1], useE131);
  artRDM.setE131Uni(portA[0], portA[1], configActive.portA_SACNuni[0]);

  // Add extra Artnet ports for WS2812:
  if (configActive.portA_mode == PORT_TYPE_WS2812 && configActive.portA_pixel_mode == PIXEL_FX_MODE_MAP) {
    if (configActive.portA_pixel_count > LIM_PIXELS_PER_ARTNET_PORT) {
      portA[2] = artRDM.addPort(portA[0], 1, configActive.portA_uni[1], PORT_TYPE_DMX_OUT, configActive.portA_merge);
      artRDM.setE131(portA[0], portA[2], useE131);
      artRDM.setE131Uni(portA[0], portA[2], configActive.portA_SACNuni[1]);
    }
    if (configActive.portA_pixel_count > (2*LIM_PIXELS_PER_ARTNET_PORT)) {
      portA[3] = artRDM.addPort(portA[0], 2, configActive.portA_uni[2], PORT_TYPE_DMX_OUT, configActive.portA_merge);
      artRDM.setE131(portA[0], portA[3], useE131);
      artRDM.setE131Uni(portA[0], portA[3], configActive.portA_SACNuni[2]);
    }
    if (configActive.portA_pixel_count > (3*LIM_PIXELS_PER_ARTNET_PORT)) {
      portA[4] = artRDM.addPort(portA[0], 3, configActive.portA_uni[3], PORT_TYPE_DMX_OUT, configActive.portA_merge);
      artRDM.setE131(portA[0], portA[4], useE131);
      artRDM.setE131Uni(portA[0], portA[4], configActive.portA_SACNuni[3]);
    }
  }

  // ----- Port B -----
  #ifndef SOLE_OUTPUT
    // Add Group:
    portB[0] = artRDM.addGroup(configActive.portB_net, configActive.portB_subnet);

    // Add Port:
    // WS2812 uses PORT_TYPE_DMX_OUT - the rest use the value assigned
    if (configActive.portB_mode == PORT_TYPE_WS2812)
      portB[1] = artRDM.addPort(portB[0], 0, configActive.portB_uni[0], PORT_TYPE_DMX_OUT, configActive.portB_merge);
    else
      portB[1] = artRDM.addPort(portB[0], 0, configActive.portB_uni[0], configActive.portB_mode, configActive.portB_merge);

    // Set E131:
    useE131 = (configActive.portB_prot == PORT_PROT_ARTNET_SACN) ? true : false;
    artRDM.setE131(portB[0], portB[1], useE131);
    artRDM.setE131Uni(portB[0], portB[1], configActive.portB_SACNuni[0]);

    // Add extra Artnet ports for WS2812:
    if (configActive.portB_mode == PORT_TYPE_WS2812 && configActive.portB_pixel_mode == PIXEL_FX_MODE_MAP) {
      if (configActive.portB_pixel_count > LIM_PIXELS_PER_ARTNET_PORT) {
        portB[2] = artRDM.addPort(portB[0], 1, configActive.portB_uni[1], PORT_TYPE_DMX_OUT, configActive.portB_merge);
        artRDM.setE131(portB[0], portB[2], useE131);
        artRDM.setE131Uni(portB[0], portB[2], configActive.portB_SACNuni[1]);
      }
      if (configActive.portB_pixel_count > (2*LIM_PIXELS_PER_ARTNET_PORT)) {
        portB[3] = artRDM.addPort(portB[0], 2, configActive.portB_uni[2], PORT_TYPE_DMX_OUT, configActive.portB_merge);
        artRDM.setE131(portB[0], portB[3], useE131);
        artRDM.setE131Uni(portB[0], portB[3], configActive.portB_SACNuni[2]);
      }
      if (configActive.portB_pixel_count > (3*LIM_PIXELS_PER_ARTNET_PORT)) {
        portB[4] = artRDM.addPort(portB[0], 3, configActive.portB_uni[3], PORT_TYPE_DMX_OUT, configActive.portB_merge);
        artRDM.setE131(portB[0], portB[4], useE131);
        artRDM.setE131Uni(portB[0], portB[4], configActive.portB_SACNuni[3]);
      }
    }
  #endif

  // Add required callback functions:
  artRDM.setArtDMXCallback(cbArtDmxReceive);
  artRDM.setArtRDMCallback(cbArtRdmReceive);
  artRDM.setArtSyncCallback(cbArtSync);
  artRDM.setArtIPCallback(cbArtIpChanged);
  artRDM.setArtAddressCallback(cbArtAddressChanged);
  artRDM.setTODRequestCallback(cbArtTodRequest);
  artRDM.setTODFlushCallback(cbArtTodFlush);

  // Set NodeReport according reset info:
  switch (resetInfo.reason) {
    case REASON_DEFAULT_RST:  // normal start
    case REASON_EXT_SYS_RST:
    case REASON_SOFT_RESTART:
      artRDM.setNodeReport((char*)"OK: Device started", ARTNET_RC_POWER_OK);
      nextNodeReport = millis() + 4000;
      break;
    case REASON_WDT_RST:
      artRDM.setNodeReport((char*)"ERROR: (HWDT) Unexpected device restart", ARTNET_RC_POWER_FAIL);
      strcpy(nodeError, "Restart error: HWDT");
      nextNodeReport = millis() + 10000;
      nodeErrorTimeout = millis() + 30000;
      break;
    case REASON_EXCEPTION_RST:
      artRDM.setNodeReport((char*)"ERROR: (EXCP) Unexpected device restart", ARTNET_RC_POWER_FAIL);
      strcpy(nodeError, "Restart error: EXCP");
      nextNodeReport = millis() + 10000;
      nodeErrorTimeout = millis() + 30000;
      break;
    case REASON_SOFT_WDT_RST:
      artRDM.setNodeReport((char*)"ERROR: (SWDT) Unexpected device restart", ARTNET_RC_POWER_FAIL);
      strcpy(nodeError, "Error on Restart: SWDT");
      nextNodeReport = millis() + 10000;
      nodeErrorTimeout = millis() + 30000;
      break;
    case REASON_DEEP_SLEEP_AWAKE:
      // not used
      break;
  }
  
  // Start artnet
  artRDM.begin();

  yield();
}

void initPorts() {
  // Port A - DMX output:
  if (configActive.portA_mode == PORT_TYPE_DMX_OUT || configActive.portA_mode == PORT_TYPE_RDM_OUT) {
    statusStrip.SetPixelColor(ADDR_STATUS_LED_A, pink);
    // Start DMX output:
    dmxA.begin(PIN_DMX_DIR_A, artRDM.getDMX(portA[0], portA[1]));
    // Setup RDM:
    if (configActive.portA_mode == PORT_TYPE_RDM_OUT && !dmxA.rdmEnabled()) {
      dmxA.rdmEnable(CONF_ESTA_MAN, CONF_ESTA_DEV);
      dmxA.rdmSetCallBack(cbDmxRdmReceiveA);
      dmxA.todSetCallBack(cbDmxSendTodA);
    }
  // Port A - DMX input:
  } else if (configActive.portA_mode == PORT_TYPE_DMX_IN) {
    statusStrip.SetPixelColor(ADDR_STATUS_LED_A, yellow);
    // Start DMX input:
    dmxA.begin(PIN_DMX_DIR_A, artRDM.getDMX(portA[0], portA[1]));
    dmxA.dmxIn(true);
    dmxA.setInputCallback(cbDmxInputReceive);

