DJMaxergy/ESP32_ArtNetNode/src/main.cpp
    dataIn = (byte*) os_malloc(sizeof(byte) * 512);
    memset(dataIn, 0, 512);
  // Port A - WS2812 output:
  } else if (configActive.portA_mode == PORT_TYPE_WS2812) {
    statusStrip.SetPixelColor(ADDR_STATUS_LED_A, green);
    // Prepare output and configure strip:
    digitalWrite(PIN_DMX_DIR_A, HIGH);
    #ifdef SOLE_OUTPUT
      pixPortA = new NeoPixelBus<NeoGrbFeature, NeoEsp8266AsyncUart0Ws2812xMethod>(configActive.portA_pixel_count, PIN_PORT_A);
    #else
      pixPortA = new NeoPixelBus<NeoGrbFeature, NeoEsp8266Uart0Ws2812xMethod>(configActive.portA_pixel_count, PIN_PORT_A);
    #endif
    pixPortA->Begin();
    if (configActive.portA_pixel_mode != PIXEL_FX_MODE_MAP) {
      pixFXA = new pixPatterns(pixPortA);
    }
  }
  
  #ifndef SOLE_OUTPUT
    // Port B - DMX output:
    if (configActive.portB_mode == PORT_TYPE_DMX_OUT || configActive.portB_mode == PORT_TYPE_RDM_OUT) {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_B, pink);
      // Start DMX output:
      dmxB.begin(PIN_DMX_DIR_B, artRDM.getDMX(portB[0], portB[1]));
      // Setup RDM:
      if (configActive.portB_mode == PORT_TYPE_RDM_OUT && !dmxB.rdmEnabled()) {
        dmxB.rdmEnable(CONF_ESTA_MAN, CONF_ESTA_DEV);
        dmxB.rdmSetCallBack(cbDmxRdmReceiveB);
        dmxB.todSetCallBack(cbDmxSendTodB);
      }
    // Port B - WS2812 output:
    } else if (configActive.portB_mode == PORT_TYPE_WS2812) {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_B, green);
      // Prepare output and configure strip:
      digitalWrite(PIN_DMX_DIR_B, HIGH);
      pixPortB = new NeoPixelBus<NeoGrbFeature, NeoEsp8266Uart1Ws2812xMethod>(configActive.portB_pixel_count, PIN_PORT_B);
      pixPortB->Begin();
      if (configActive.portB_pixel_mode != PIXEL_FX_MODE_MAP) {
        pixFXB = new pixPatterns(pixPortB);
      }
    }
  #endif
}

#ifdef OLED
void initDisplay() {
  display.begin(SSD1306_SWITCHCAPVCC, 0);
  display.setTextWrap(false);
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  // Clear display to prevent that Adafruit logo gets shown:
  display.clearDisplay();

  // Show boot logo on OLED display:
  display.drawBitmap(0, 0, dispLogo, DISP_LOGO_WIDTH, DISP_LOGO_HEIGHT, 1);
  display.display();
}
#endif

/* ############# Init functions end ############# */

void doNodeReport() {
  if (nextNodeReport > millis()) {
    // Time for next node report not reached
    return;
  }
  
  char c[ARTNET_NODE_REPORT_LENGTH];
  char pixelInfo[20];

  if (nodeErrorTimeout > millis()) {
    // No timeout -> Do next node report in 2s
    nextNodeReport = millis() + 2000;
  } else {
    // Timeout -> Do next node report in 5s
    nextNodeReport = millis() + 5000;
  }
  
  if (nodeError[0] != '\0' && !nodeErrorShowing && nodeErrorTimeout > millis()) {
    nodeErrorShowing = true;
    strcpy(c, nodeError);
  } else {
    nodeErrorShowing = false;
    strcpy(c, "OK: PortA:");
    switch (configActive.portA_mode) {
      case PORT_TYPE_DMX_OUT:
        strcat(c, " DMX Out");
        break;
      case PORT_TYPE_RDM_OUT:
        strcat(c, " RDM Out");
        break;
      case PORT_TYPE_DMX_IN:
        strcat(c, " DMX In");
        break;
      case PORT_TYPE_WS2812:
        if (configActive.portA_pixel_mode == PIXEL_FX_MODE_12) {
          strcat(c, " 12chan");
        }
        sprintf(pixelInfo, " WS2812 %ipixels", configActive.portA_pixel_count);
        strcat(c, pixelInfo);
        break;
    }
  
    #ifndef SOLE_OUTPUT
      strcat(c, ". PortB:");
      switch (configActive.portB_mode) {
        case PORT_TYPE_DMX_OUT:
          strcat(c, " DMX Out");
          break;
        case PORT_TYPE_RDM_OUT:
          strcat(c, " RDM Out");
          break;
        case PORT_TYPE_DMX_IN:
          /* Not possible -> Do nothing here */
          break;
        case PORT_TYPE_WS2812:
          if (configActive.portB_pixel_mode == PIXEL_FX_MODE_12) {
            strcat(c, " 12chan");
          }
          sprintf(pixelInfo, " WS2812 %ipixels", configActive.portB_pixel_count);
          strcat(c, pixelInfo);
          break;
      }
    #endif
  }
  
  artRDM.setNodeReport(c, ARTNET_RC_POWER_OK);
}

void pauseDmxOutputHandler(bool pause) {
  if (pause == true) {
    if ((dmxOutAPaused == false) && (configActive.portA_mode != PORT_TYPE_WS2812) && (configActive.portA_mode != PORT_TYPE_DMX_IN)) {
      dmxA.pause();
      dmxOutAPaused = true;
    }
    #ifndef SOLE_OUTPUT
      if ((dmxOutBPaused == false) && (configActive.portB_mode != PORT_TYPE_WS2812)) {
        dmxB.pause();
        dmxOutBPaused = true;
      }
    #endif
  } else {
    if (dmxOutAPaused == true) {
      dmxA.unPause();
      dmxOutAPaused = false;
    }
    #ifndef SOLE_OUTPUT
      if (dmxOutBPaused == true) {
        dmxB.unPause();
        dmxOutBPaused = false;
      }
    #endif
  }
}

/* ______________ Setup function ______________ */
void setup(void) {
  #ifdef DEBUG
    Serial.begin(115200);
    Serial.println("DEBUG mode enabled");
  #endif

  // Make direction input to avoid boot garbage being sent out
  pinMode(PIN_DMX_DIR_A, OUTPUT);
  digitalWrite(PIN_DMX_DIR_A, LOW);
  #ifndef SOLE_OUTPUT
    pinMode(PIN_DMX_DIR_B, OUTPUT);
    digitalWrite(PIN_DMX_DIR_B, LOW);
  #endif

  // Initialize Status LEDs:
  statusStrip.Begin();
  statusStrip.SetPixelColor(ADDR_STATUS_LED_S, pink);
  statusStrip.SetPixelColor(ADDR_STATUS_LED_A, black);
  statusStrip.SetPixelColor(ADDR_STATUS_LED_B, black);
  statusStrip.Show();

  // Initialize OLED Display:
  #ifdef OLED
    initDisplay();
  #endif

  // Initialize Reset Config Button:
  bool resetDefaults = false;
  #ifdef PIN_RESET_CONFIG
    pinMode(PIN_RESET_CONFIG, INPUT);
    delay(5);
    // button pressed = low reading
    if (!digitalRead(PIN_RESET_CONFIG)) {
      delay(50);
      if (!digitalRead(PIN_RESET_CONFIG))
        resetDefaults = true;
    }
  #endif

  // Start LittleFS file system
  LittleFS.begin();
  // Load saved values or store defaults
  if (resetDefaults == false) {
    config_load();
  } else {
    config_init();
    config_save();
  }

  // Store our counters for resetting defaults
  if (resetInfo.reason != REASON_DEFAULT_RST && resetInfo.reason != REASON_EXT_SYS_RST && resetInfo.reason != REASON_SOFT_RESTART)
    config.wdtCounter++;
  else
    config.resetCounter++;
  // Store updated debug values
  config_save();

  // Set active config, used in loop() and callbacks
  configActive = config;

  // We only allow 1 DMX input - and RDM can't run alongside DMX in
  if (configActive.portA_mode == PORT_TYPE_DMX_IN && configActive.portB_mode == PORT_TYPE_RDM_OUT) {
    configActive.portB_mode = PORT_TYPE_DMX_OUT;
  }

  // Start wifi
  initWifi();

  // Setup Artnet Ports & Callbacks
  initArtnet();

  // Port Setup
  #ifndef DEBUG
    // Don't open any ports for a bit to let the ESP spill it's garbage to serial
    while (millis() < 3500)
      yield();

    initPorts();
  #endif

  // Start web server
  initWebServer();

  delay(10);

