DJMaxergy/ESP32_ArtNetNode/src/main.cpp
  #ifdef OLED
    // Show node name and ip address on OLED display
    display.clearDisplay();
    display.setCursor(0,0);
    display.print(configActive.gen_nodeName);
    display.setCursor(0,16);
    if (configActive.net_ap_standalone == false && configActive.net_sta_ssid[0] != '\0') {
      display.print("STA - " + configActive.net_sta_ip.toString());
    } else {
      display.print("AP - " + configActive.net_ap_ip.toString());
    }
    display.display();
  #endif
}
/* ______________ Setup function end ______________ */

/* _________________ loop function ________________ */
void loop(void){
  // If the device lasts for 6 seconds, clear our reset timers
  if (config.resetCounter != 0 && millis() > TIMEOUT_CLEAR_COUNTERS) {
    config.resetCounter = 0;
    config.wdtCounter = 0;
    config_save();
    configActive.resetCounter = 0;
    configActive.wdtCounter = 0;
    ESPUI.updateNumber(numWdtCounter, configActive.wdtCounter);
    ESPUI.updateNumber(numRstCounter, configActive.resetCounter);
  }

  // Process mDNS for captive portal (only relevant for access point)
  if (accessPointStarted == true) {
    dnsServer.processNextRequest();
  }
  
  // Get the node details and handle Artnet
  doNodeReport();
  artRDM.handler();
  
  yield();

  #ifndef DEBUG
    // When no ArtNet data is received anymore, pause DMX output after timeout for better webserver performance:
    if ((artDmxReceiving == false) && (millis() > artDmxReceiveTimer)) {
      pauseDmxOutputHandler(true);
    } else {
      artDmxReceiveTimer = millis() + TIMEOUT_DMX;
      artDmxReceiving = false;
      pauseDmxOutputHandler(false);
    }
    // When someone is connected to webserver, pause DMX output (disarm UART interrupts) for better webserver performance:
    if (ESPUI.ws->count() > 0) {
      pauseDmxOutputHandler(true);
    } else if (ESPUI.ws->count() == 0) {
      pauseDmxOutputHandler(false);
    }

    // DMX handlers
    if (configActive.portA_mode != PORT_TYPE_WS2812) {
      dmxA.handler();
    }
    #ifndef SOLE_OUTPUT
      if (configActive.portB_mode != PORT_TYPE_WS2812) {
        dmxB.handler();
      }
    #endif

    if (ESPUI.ws->count() == 0) {
      // Do Pixel FX on port A
      if (configActive.portA_mode == PORT_TYPE_WS2812 && configActive.portA_pixel_mode != PIXEL_FX_MODE_MAP && pixFXA != NULL) {
        if (pixFXA->Update())
          pixDone = 0;
      }
      // Do Pixel FX on port B
      #ifndef SOLE_OUTPUT
        if (configActive.portB_mode == PORT_TYPE_WS2812 && configActive.portB_pixel_mode != PIXEL_FX_MODE_MAP && pixFXB != NULL) {
          if (pixFXB->Update())
            pixDone = 0;
        }
      #endif
    }
  #endif

  // Do pixel string output
  if (!pixDone)
  {
    if (pixPortA != NULL) {
      pixPortA->Show();
    }
    #ifndef SOLE_OUTPUT
      if (pixPortB != NULL) {
        pixPortB->Show();
      }
    #endif
  }

  // Handle received DMX
  if (newDmxIn) { 
    uint8_t g, p;
    newDmxIn = false;
    g = portA[0];
    p = portA[1];
    
    IPAddress bc = configActive.net_dmxIn_broadcast;
    artRDM.sendDMX(g, p, bc, dataIn, 512);

    statusStrip.SetPixelColor(ADDR_STATUS_LED_A, blue); //yellow
  }

  // Handle rebooting the system
  if (doReboot) {
    char c[ARTNET_NODE_REPORT_LENGTH] = "Device rebooting...";
    artRDM.setNodeReport(c, ARTNET_RC_POWER_OK);
    artRDM.artPollReply();

    ESP.restart();
  }

  // Output status to LEDs
  if ((statusTimer < millis()) && (Update.isRunning() == false)) {
    // Flash status LEDs
    if ((statusTimer % (2*INTERVAL_STATUS_LED)) > INTERVAL_STATUS_LED) {
      // Flash main status LED
      if (nodeError[0] != '\0') {
        statusStrip.SetPixelColor(ADDR_STATUS_LED_S, red);
      } else {
        statusStrip.SetPixelColor(ADDR_STATUS_LED_S, black);
      }
      // Reset port status LEDs in case of not receiving data anymore
      if (statusStrip.GetPixelColor(ADDR_STATUS_LED_A) == blue) {
        if (configActive.portA_mode == PORT_TYPE_DMX_OUT || configActive.portA_mode == PORT_TYPE_RDM_OUT) {
          statusStrip.SetPixelColor(ADDR_STATUS_LED_A, pink);
        } else if (configActive.portA_mode == PORT_TYPE_WS2812) {
          statusStrip.SetPixelColor(ADDR_STATUS_LED_A, green);
        } else if (configActive.portA_mode == PORT_TYPE_DMX_IN) {
          statusStrip.SetPixelColor(ADDR_STATUS_LED_A, yellow);
        }
      }
      if (statusStrip.GetPixelColor(ADDR_STATUS_LED_B) == blue) {
        if (configActive.portB_mode == PORT_TYPE_DMX_OUT || configActive.portB_mode == PORT_TYPE_RDM_OUT) {
          statusStrip.SetPixelColor(ADDR_STATUS_LED_B, pink);
        } else if (configActive.portB_mode == PORT_TYPE_WS2812) {
          statusStrip.SetPixelColor(ADDR_STATUS_LED_B, green);
        }
      }
    // Set main status LED according connection state
    } else if (((accessPointStarted == true) && (WiFi.softAPgetStationNum() > 0) && (ESPUI.ws->count() == 0)) ||
               ((accessPointStarted == false) && (WiFi.status() == WL_CONNECTED) && (ESPUI.ws->count() == 0))) {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_S, green);
    } else if (ESPUI.ws->count() > 0) {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_S, blue);
    } else {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_S, white);
    }

    statusStrip.Show();
    statusTimer = millis() + INTERVAL_STATUS_LED;
  // Output update status to LEDs
  } else if ((statusTimer < millis()) && (Update.isRunning() == true)) {
    if ((statusTimer % (2*INTERVAL_STATUS_LED_UPDATE)) > INTERVAL_STATUS_LED_UPDATE) {
      statusStrip.SetPixelColor(ADDR_STATUS_LED_S, black);
      statusStrip.SetPixelColor(ADDR_STATUS_LED_A, black);
      statusStrip.SetPixelColor(ADDR_STATUS_LED_B, black);
    } else
    {
      if (((Update.progress()*100)/Update.size()) > 0) {
        statusStrip.SetPixelColor(ADDR_STATUS_LED_S, cyan);
      }
      if (((Update.progress()*100)/Update.size()) > 33) {
        statusStrip.SetPixelColor(ADDR_STATUS_LED_A, cyan);
      }
      if (((Update.progress()*100)/Update.size()) > 66) {
        statusStrip.SetPixelColor(ADDR_STATUS_LED_B, cyan);
      }
    }

    statusStrip.Show();
    statusTimer = millis() + INTERVAL_STATUS_LED_UPDATE;
  }
}
/* _______________ loop function end ______________ */
